{"title":"New Game! :D","_date":"19/02/2021","slug":"new-game","html":"&emsp; &emsp; <u><i>19/02/2021</i></u>\n\t\t<br><br>&emsp; &emsp;Hey everyone! I've decided to start a new project and thought it would be a good idea to post some devlogs here! The game is gonna be a platformer game, with the multiverse incorporated.\n\t\t<br><br>&emsp; &emsp;The protagonist is going to be able to control space-time, with powers such as rewinding time, and having the ability to create matter (in the form of platforms). He will also be able to travel in-between the different dimensions and worlds in the multiverse. I'm planning on adding many different dimensions, including but not limited to:\n\t\t<br>\n\t\t<ul>\n<li>\n\t<b>Main Dimension</b> - <i>Earth; Normal Dimension</i>\n</li>\n<li>\n\t<b>Micro Dimension</b> - <i>Similar to main dimension, but everything is small</i>\n</li>\n<li>\n\t<b>Mega Dimension</b> - <i>Similar to main dimension, but everything is big</i>\n</li>\n<li>\n\t<b>Fire Dimension</b> - <i>Fire, lava, and molten rock everywhere. Home to fire demon things, and one of the bosses of the game!</i>\n</li>\n<li>\n\t<b>Ice Dimension</b> - <i>All frozen, subzero temperatures, and alot of sharp glaciers. Home to ice monster creatures, and one of the bosses of the game!</i>\n</li>\n<li>\n\t<b>Mirror Dimension</b> - <i>Completely identical to the normal dimension, and home to the <u>Doppelganger</u>, the game's final boss - a duplicate version of the player character who has the same powers</i>\n</li>\n\t\t</ul> \n\t\t<br>&emsp; &emsp; I also wanted to balance the player's SPACE TIME MANIPULATION powers, so I decided to add this dimension as well:\n\t\t<ul>\n<li>\n\t<b>Spirit Dimension</b> - <i>If the player abuses their time-space powers, they get sent to the spirit dimension. In this dimension, Time works differently, changing the player's very particles. He has to quickly escape the dimension, before its too late... before he gets ripped apart. Also, all beings subject to this dimension leave a solid state, hence its name, making powers to create platforms and such useless.</i>\n</li>\n</li>\n\t\t</ul>\n\t\t<br>&emsp; &emsp; Yeah.... I gotta work on those names lol.\n\t\t<br><br>&emsp; &emsp; If you want to keep up with the development, follow me on my <a href=\"https://www.youtube.com/channel/UC2W0dJwYSOHm4Rn1p17P6qg\">YouTube</a> and my <a href=\"https://www.twitch.tv/opsci\">Twitch</a>, where I'll try to post devlogs! Also stay tuned here as well! And I'd love feedback and/or ideas - if you've got any, let me know on YouTube, Twitch, or in my <a href=\"https://discord.gg/vxvksvd/\">Discord Server</a>! Cya next time everyone!\n\t\t"}